tap "anomalyco/tap"
tap "detachhead/tap"
tap "fraluc06/ffmpeg-svt-av1-essential"
tap "fraluc06/tap"
tap "gromgit/brewtils"
tap "homebrew/cask"
tap "homebrew/core"
tap "kavostudio/tap"
tap "oven-sh/bun"
tap "protonpass/tap"
brew "actionlint"
brew "age"
brew "xz"
brew "atuin"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bat-extras"
brew "btop"
brew "bzip2"
brew "caddy"
brew "carapace"
brew "cmake"
brew "container-compose"
brew "docker-compose"
brew "duf"
brew "ekphos"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "readline"
brew "sqlite"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "glow"
brew "gnupg"
brew "go"
brew "libtool"
brew "imagemagick"
brew "jj"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libyaml"
brew "mas"
brew "mise"
brew "mole"
brew "nasm"
brew "neovim"
brew "nushell"
brew "onefetch"
brew "ouch"
brew "pastel"
brew "pdfcpu"
brew "pinact"
brew "pkgconf"
brew "poppler"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "superfile"
brew "termscp"
brew "tlrc"
brew "tuckr"
brew "zellij"
brew "zinit"
brew "zizmor"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "fraluc06/ffmpeg-svt-av1-essential/svt-av1-essential"
brew "fraluc06/tap/burnmail"
brew "fraluc06/tap/mkvtea"
brew "gromgit/brewtils/taproom"
brew "oven-sh/bun/bun"
brew "protonpass/tap/pass-cli"
cask "affinity"
cask "batfi"
cask "clion"
cask "clop"
cask "discord"
cask "displaybuddy"
cask "downie"
cask "filen"
cask "finetune"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "helium-browser"
cask "iina"
cask "iloader"
cask "intellij-idea"
cask "keka"
cask "latest"
cask "lm-studio"
cask "localsend"
cask "macshot"
cask "mactex-no-gui"
cask "macusb"
cask "mediainfo"
cask "kavostudio/tap/moonvert"
cask "mullvad-vpn"
cask "onlyoffice"
cask "opencode-desktop"
cask "orbstack"
cask "orion"
cask "permute"
cask "prismlauncher"
cask "proton-pass"
cask "raycast"
cask "detachhead/tap/rebased"
cask "spotify"
cask "stats"
cask "telegram"
cask "temurin"
cask "thaw@beta"
cask "transmit"
cask "utm"
cask "visual-studio-code"
cask "wallspace"
cask "whatsapp"
cask "wins"
cask "yaak"
cask "zed"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "PDFgear", id: 6469021132
mas "Shareful", id: 1522267256
mas "SitTall", id: 6761648859
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "asispts.neo-git-graph"
vscode "astro-build.astro-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "onlyati.quadlet-lsp"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "rangav.vscode-thunder-client"
vscode "unifiedjs.vscode-mdx"
vscode "xabikos.javascriptsnippets"
vscode "yandeu.five-server"
